Revit 2027 API
Element.GetOrderedParameters Method
 Gets the parameters associated to the element in order.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<Parameter> GetOrderedParameters()
Public Function GetOrderedParameters As IList(Of Parameter)
public:
IList<Parameter^>^ GetOrderedParameters()
member GetOrderedParameters : unit -> IList<Parameter>
Return Value
IList<Parameter>
 A collection containing all parameters.
Remarks
The collection consists of only visible parameters associated to the element; it returns a different list than Element.Parameters.
The parameters are returned in the order in which they appear in the Revit UI within a given group; however, parameters of different groups may be mixed within this output.
Currently the Revit UI order is determined first by group and next by the order of the individual parameters.
See Also
Reference
Element Class
Autodesk.Revit.DB Namespace